   //app.js
App({
  globalData: {
    StudentProvince: 0,
    StudentKelei: 0,
    StudentGrade: 0,
    StudentRank: 0,
    AccomandSchool: ['北京大学', '中国人民大学', '清华大学', '北京航空航天大学', '北京理工大学'],
    AccomandSchoolID: ['1', '2', '3', '4', '5'],
    AllSchool: ['北京工业大学', '北京大学', '内蒙古大学', '西北大学', '北京交通大学', '哈尔滨工业大学', '大连海事大学', '北京外国语大学', '云南大学', '长安大学'],
    SelectedSchool:[],
    SelectedSchoolID: [],
    success_ratio: [0.13, 0.11, 0.42, 0.47, 0.72],
    FocusSchool: ['学校名称'],
    FocusSchoolID:['id'],
    SchoolName: ['北京工业大学', '北京大学', '内蒙古大学', '西北大学', '北京交通大学', '哈尔滨工业大学', '大连海事大学', '北京外国语大学', '云南大学', '长安大学'],
    SchoolID: [44, 1, 61, 101, 43, 14, 63, 51, 99, 113],
    SchoolScore: [
      [
        ['2017', '580'],
        ['2016', '--'],
        ['2015', '--']
      ],
      [
        ['2017', '660'],
        ['2016', '673'],
        ['2015', '--']
      ],
      [
        ['2017', '556'],
        ['2016', '--'],
        ['2015', '--']
      ],
      [
        ['2017', '595'],
        ['2016', '605'],
        ['2015', '--']
      ],
      [
        ['2017', '608'],
        ['2016', '640'],
        ['2015', '--']
      ],
      [
        ['2017', '609'],
        ['2016', '632'],
        ['2015', '628']
      ],
      [
        ['2017', '566'],
        ['2016', '589'],
        ['2015', '--']
      ],
      [
        ['2017', '637'],
        ['2016', '650'],
        ['2015', '--']
      ],
      [
        ['2017', '--'],
        ['2016', '--'],
        ['2015', '--']
      ],
      [
        ['2017', '--'],
        ['2016', '--'],
        ['2015', '--']
      ]
    ]
  },
  onLaunch: function() {
    console.log('App Launch')
  },
  onShow: function() {
    console.log('App Show')
  },
  onHide: function() {
    console.log('App Hide')
  }
})