var app = getApp(); //其后可通过app变量获取全局变量（存于globalData）
Page({
  data: {
    multiArray: [
      ['门类', '人文社科类', '理学', '工学', '农学', '医学', '管理学', '艺术学'],
      ['一级学科',
        '0101 哲学',

        '0201 理论经济学',

        '0202 应用经济学',

        '0301 法学',

        '0302 政治学',

        '0303 社会学',

        '0304 民族学',

        '0305 马克思主义理论',

        '0401 教育学',

        '0402 心理学',

        '0403 体育学',

        '0501 中国语言文学',

        '0502 外国语言文学',

        '0503 新闻传播学',

        '0601 考古学',

        '0602 中国史',

        '0603 世界史'
      ]
    ],
    objectMultiArray: [
      [{
        id: 0,
        name: '门类'
      }, {
        id: 1,
        name: '人文社科类'
      }, {
        id: 2,
        name: '理学'
      }, {
        id: 3,
        name: '工学'
      }, {
        id: 4,
        name: '农学'
      }, {
        id: 5,
        name: '医学'
      }, {
        id: 6,
        name: '管理学'
      }, {
        id: 7,
        name: '艺术学'
      }],
      [{
        id: 0,
        name: '一级学科'
      },
      {
        id: 1,
        name: '0101 哲学'
      }, {
        id: 2,
        name: '0201 理论经济学'
      }, {
        id: 3,
        name: '0202 应用经济学'
      }, {
        id: 4,
        name: '0301 法学'
      }, {
        id: 5,
        name: '0302 政治学'
      }, {
        id: 6,
        name: '0303 社会学'
      }, {
        id: 7,
        name: '0304 民族学'
      }, {
        id: 8,
        name: '0305 马克思主义理论'
      }, {
        id: 9,
        name: '0401 教育学'
      }, {
        id: 10,
        name: '0402 心理学'
      }, {
        id: 11,
        name: '0403 体育学'
      }, {
        id: 12,
        name: '0501 中国语言文学'
      }, {
        id: 13,
        name: '0502 外国语言文学'
      }, {
        id: 14,
        name: '0503 新闻传播学'
      }, {
        id: 15,
        name: '0601 考古学'
      }, {
        id: 16,
        name: '0602 中国史'
      }, {
        id: 17,
        name: '0603 世界史'
      }]
    ],
    multiIndex: [0, 0], //表示多列选择器中两列所选项位置（门类，一级学科）
  },





  bindMultiPickerChange: function (e) {
    //监听多列选择器输入（门类，一级学科）
    console.log('picker发送选择改变，携带值为', e.detail.value)
    this.setData({
      multiIndex: e.detail.value
    })
  },
  bindMultiPickerColumnChange: function (e) {
    console.log('修改的列为', e.detail.column, '，值为', e.detail.value);
    var data = {
      multiArray: this.data.multiArray,
      multiIndex: this.data.multiIndex
    };
    data.multiIndex[e.detail.column] = e.detail.value;
    switch (e.detail.column) {
      case 0:
        switch (data.multiIndex[0]) {
          case 0:
            data.multiArray[1] = ['一级学科'
            ];
            break;
          case 1:
            data.multiArray[1] = ['0101 哲学',

              '0201 理论经济学',

              '0202 应用经济学',

              '0301 法学',

              '0302 政治学',

              '0303 社会学',

              '0304 民族学',

              '0305 马克思主义理论',

              '0401 教育学',

              '0402 心理学',

              '0403 体育学',

              '0501 中国语言文学',

              '0502 外国语言文学',

              '0503 新闻传播学',

              '0601 考古学',

              '0602 中国史',

              '0603 世界史'
            ];
            break;
          case 2:
            data.multiArray[1] = ['0701 数学',

              '0702 物理学',

              '0703 化学',

              '0704 天文学',

              '0705 地理学',

              '0706 大气科学',

              '0707 海洋科学',

              '0708 地球物理学',

              '0709 地质学',

              '0710 生物学',

              '0711 系统科学',

              '0712 科学技术史',

              '0713 生态学',

              '0714 统计学'
            ];
            break;
          case 3:
            data.multiArray[1] = ['0801 力学',

              '0802 机械工程',

              '0803 光学工程',

              '0804 仪器科学与技术',

              '0805 材料科学与工程',

              '0806 冶金工程',

              '0807 动力工程及工程热物理',

              '0808 电气工程',

              '0809 电子科学与技术',

              '0810 信息与通信工程',

              '0811 控制科学与工程',

              '0812 计算机科学与技术',

              '0813 建筑学',

              '0814 土木工程',

              '0815 水利工程',

              '0816 测绘科学与技术',

              '0817 化学工程与技术',

              '0818 地质资源与地质工程',

              '0819 矿业工程',

              '0820 石油与天然气工程',

              '0821 纺织科学与工程',

              '0822 轻工技术与工程',

              '0823 交通运输工程',

              '0824 船舶与海洋工程',

              '0825 航空宇航科学与技术',

              '0826 兵器科学与技术',

              '0827 核科学与技术',

              '0828 农业工程',

              '0829 林业工程',

              '0830 环境科学与工程',

              '0831 生物医学工程',

              '0832 食品科学与工程',

              '0833 城乡规划学',

              '0834 风景园林学',

              '0835 软件工程',

              '0837 安全科学与工程'
            ];
            break;
          case 4:
            data.multiArray[1] = ['0901 作物学',

              '0902 园艺学',

              '0903 农业资源与环境',

              '0904 植物保护',

              '0905 畜牧学',

              '0906 兽医学',

              '0907 林学',

              '0908 水产',

              '0909 草学'
            ];
            break;
          case 5:
            data.multiArray[1] = ['1001 基础医学',

              '1002 临床医学',

              '1003 口腔医学',

              '1004 公共卫生与预防医学',

              '1005 中医学',

              '1006 中西医结合',

              '1007 药学',

              '1008 中药学',

              '1011 护理学'
            ];
            break;
          case 6:
            data.multiArray[1] = ['1201 管理科学与工程',

              '1202 工商管理',

              '1203 农林经济管理',

              '1204 公共管理',

              '1205 图书情报与档案管理'
            ];
            break;
          case 7:
            data.multiArray[1] = ['1301 艺术学理论',

              '1302 音乐与舞蹈学',

              '1303 戏剧与影视学',

              '1304 美术学',

              '1305 设计学'
            ];
            break;
        }
        data.multiIndex[1] = 0;
        break;


        console.log(data.multiIndex);
        break;
    }
    this.setData(data);
  },
})
